ГТС/УТГТС/Enums/ТипыПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПервичныхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеУПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаТоваровКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяНакладная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаЧерезПодотчетноеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетДавальцу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетПереработчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаРеализации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаПриобретения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПремииКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПремииПоставщика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ТипыПервичныхДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет в переданный параметр значения перечисление "Типы первичных документов"
//
// Параметры:
//  ДанныеВыбора - СписокЗначений из ПеречислениеСсылка.ТипыПервичныхДокументов
//  			 - Массив из ПеречислениеСсылка.ТипыПервичныхДокументов - коллекция, в которую добавляются значения перечисление
//  Параметры    - см. ПараметрыИспользования
//
Процедура ЗаполнитьДанныеВыбора(ДанныеВыбора, Знач Параметры = Неопределено) Экспорт
	
	Если Параметры = Неопределено Тогда
		Параметры = ПараметрыИспользования();
	КонецЕсли;
	
	ДанныеВыбора.Очистить();
	
	Для каждого Параметр Из Параметры Цикл
		
		Если Параметр.Значение Тогда
			ДанныеВыбора.Добавить(Перечисления.ТипыПервичныхДокументов[Параметр.Ключ]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает параметры использования типов первичных документов.
//
// Возвращаемое значение:
//  Структура - содержит:
//   * ПриобретениеУПоставщика     - Булево - 
//   * РеализацияКлиенту           - Булево - 
//   * КорректировкаПриобретения   - Булево - 
//   * КорректировкаРеализации     - Булево - 
//   * ОплатаПоставщику            - Булево - 
//   * ОплатаОтКлиента             - Булево -
//   * АктПремииКлиенту            - Булево -
//   * АктПремииПоставщика         - Булево -
//   * ВнутренняяНакладная         - Булево -
//   * ЗакупкаЧерезПодотчетноеЛицо - Булево -
//   * ПриемНаХранение             - Булево -
//   * ОтчетДавальцу               - Булево -
//   * ОтчетПереработчика          - Булево -
//
Функция ПараметрыИспользования() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ПриобретениеУПоставщика",     Истина);
	Параметры.Вставить("РеализацияКлиенту",           Истина);
	Параметры.Вставить("ОплатаПоставщику",            Истина);
	Параметры.Вставить("ОплатаОтКлиента",             Истина);
	Параметры.Вставить("ВнутренняяНакладная",         Истина);
	Параметры.Вставить("ЗакупкаЧерезПодотчетноеЛицо", Истина);
	Параметры.Вставить("ПриемНаХранение",             Ложь);
	Параметры.Вставить("ОтчетДавальцу",               Ложь);
	Параметры.Вставить("ОтчетПереработчика",          Ложь);
	Параметры.Вставить("КорректировкаПриобретения",   ПолучитьФункциональнуюОпцию("ИспользоватьКорректировкиПриобретений"));
	Параметры.Вставить("КорректировкаРеализации",     ПолучитьФункциональнуюОпцию("ИспользоватьКорректировкиРеализаций"));
	Параметры.Вставить("АктПремииКлиенту",            ПолучитьФункциональнуюОпцию("ИспользоватьРетроБонусыКлиентов"));
	Параметры.Вставить("АктПремииПоставщика",         ПолучитьФункциональнуюОпцию("ИспользоватьРетроБонусыПоставщиков"));
	
	Параметры.Вставить("ОтгрузкаТоваровКлиенту",
		ПолучитьФункциональнуюОпцию("ИспользоватьОтгрузкуБезПереходаПраваСобственности2_5"));
	
	
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#КонецЕсли
